#include "Text.h"

void mainMenu() {
	system("cls");
	cout << "  ____________________________________ " << endl;
	cout << " |              Меню                  |" << endl;
	cout << " |____________________________________|" << endl;
	cout << " | 1.Войти как администратор          |" << endl;
	cout << " |____________________________________|" << endl;
	cout << " | 2.Войти как пользователь           |" << endl;
	cout << " |____________________________________|" << endl;
	cout << " | 0.Выход                            |" << endl;
	cout << " |____________________________________|" << endl;
	cout << endl;
	cout << " Ваш выбор: ";

}

void adminMenu() {

	system("cls");
	cout << "  ____________________________________ " << endl;
	cout << " |        Меню администратора         |" << endl;
	cout << " |____________________________________|" << endl;
	cout << " | 1.Работа с пользователями          |" << endl;
	cout << " |____________________________________|" << endl;
	cout << " | 2.Работа с отделами                |" << endl;
	cout << " |____________________________________|" << endl;
	cout << " | 3.Работа с сотрудниками            |" << endl;
	cout << " |____________________________________|" << endl;
	cout << " | 4.Приняте решения                  |" << endl;
	cout << " |____________________________________|" << endl;
	cout << " | 0.Выход                            |" << endl;
	cout << " |____________________________________|" << endl;
	cout << endl;
	cout << " Ваш выбор: ";
}

void userMenu() {

	system("cls");
	cout << "  ____________________________________ " << endl;
	cout << " |         Меню пользователя          |" << endl;
	cout << " |____________________________________|" << endl;
	cout << " | 1.Посмотреть                       |" << endl;
	cout << " |____________________________________|" << endl;
	cout << " | 2.Проголосовать                    |" << endl;
	cout << " |____________________________________|" << endl;
	cout << " | 0.Выход                            |" << endl;
	cout << " |____________________________________|" << endl;
	cout << endl;
	cout << " Ваш выбор: ";

}

void userManageMenu() {

	system("cls");
	cout << "  ____________________________________ " << endl;
	cout << " |     Управление пользователями      |" << endl;
	cout << " |____________________________________|" << endl;
	cout << " | 1.Добавить пользователя            |" << endl;
	cout << " |____________________________________|" << endl;
	cout << " | 2.Вывести список пользователей     |" << endl;
	cout << " |____________________________________|" << endl;
	cout << " | 3.Удалить пользователя             |" << endl;
	cout << " |____________________________________|" << endl; 
	cout << " | 4.Удалить всех пользователей       |" << endl;
	cout << " |____________________________________|" << endl;
	cout << " | 0.Выход                            |" << endl;
	cout << " |____________________________________|" << endl;
	cout << endl;
	cout << " Ваш выбор: ";

}

void departmentManageMenu() {

	system("cls");
	cout << "  ____________________________________ " << endl;
	cout << " |        Управление отделами         |" << endl;
	cout << " |____________________________________|" << endl;
	cout << " | 1.Добавить отдел                   |" << endl;
	cout << " |____________________________________|" << endl;
	cout << " | 2.Редактировать отдел              |" << endl;
	cout << " |____________________________________|" << endl;
	cout << " | 3.Вывести список отделов           |" << endl;
	cout << " |____________________________________|" << endl;
	cout << " | 4.Удалить отдел                    |" << endl;
	cout << " |____________________________________|" << endl;
	cout << " | 5.Удалить все отделы               |" << endl;
	cout << " |____________________________________|" << endl;
	cout << " | 6.Поиск отдела                     |" << endl;
	cout << " |____________________________________|" << endl;
	cout << " | 7.Сортировка отделов               |" << endl;
	cout << " |____________________________________|" << endl;
	cout << " | 0.Выход                            |" << endl;
	cout << " |____________________________________|" << endl;
	cout << endl;
	cout << " Ваш выбор: ";

}

void employeesManageMenu() {

	system("cls");
	cout << "  ____________________________________ " << endl;
	cout << " |       Управление сотрудниками      |" << endl;
	cout << " |____________________________________|" << endl;
	cout << " | 1.Добавить сотрудника              |" << endl;
	cout << " |____________________________________|" << endl;
	cout << " | 2.Редактировать сотрудника         |" << endl;
	cout << " |____________________________________|" << endl;
	cout << " | 3.Вывести список сотрудников       |" << endl;
	cout << " |____________________________________|" << endl;
	cout << " | 4.Удалить сотрудника               |" << endl;
	cout << " |____________________________________|" << endl;
	cout << " | 5.Удалить всех сотрудников         |" << endl;
	cout << " |____________________________________|" << endl;
	cout << " | 6.Поиск сотрудника                 |" << endl;
	cout << " |____________________________________|" << endl;
	cout << " | 7.Сортировка сотрудников           |" << endl;
	cout << " |____________________________________|" << endl;
	cout << " | 8.Фильтрация сотрудников           |" << endl;
	cout << " |____________________________________|" << endl;
	cout << " | 0.Выход                            |" << endl;
	cout << " |____________________________________|" << endl;
	cout << endl;
	cout << " Ваш выбор: ";

}

void departmentEditMenu() {

	system("cls");
	cout << "  _______________________________________ " << endl;
	cout << " |        Редактирование отделов         |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 1.Редактировать ID                    |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 2.Редактировать название              |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 3.Редактировать заведующего           |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 4.Редактировать количество работников |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 5.Редактировать телефон               |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 0.Выход                               |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << endl;
	cout << " Ваш выбор: ";

}

void departmentSearchMenu() {

	system("cls");
	cout << "  _______________________________________ " << endl;
	cout << " |            Поиск отделов              |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 1.Поиск по ID                         |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 2.Поиск по названию                   |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 3.Поиск по заведующему                |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 4.Поиск по количеству работников      |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 5.Поиск по телефону                   |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 0.Выход                               |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << endl;
	cout << " Ваш выбор: ";

}

void departmentSortMenu() {

	system("cls");
	cout << "  _______________________________________ " << endl;
	cout << " |         Сортировка отделов            |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 1.Сортировать по ID                   |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 2.Сортировать по названию             |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 3.Сортировать по заведующему          |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 4.Сортировать по количеству работников|" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 5.Сортировать по телефону             |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 0.Выход                               |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << endl;
	cout << " Ваш выбор: ";

}

void emoloyeesEditMenu() {

	system("cls");
	cout << "  _______________________________________ " << endl;
	cout << " |      Редактирование сотрудников       |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 1.Редактировать ID                    |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 2.Редактировать должность             |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 3.Редактировать имя                   |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 4.Редактировать фамилию               |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 5.Редактировать возраст               |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 6.Редактировать стаж                  |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 0.Выход                               |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << endl;
	cout << " Ваш выбор: ";

}

void emoloyeesSearchMenu() {

	system("cls");
	cout << "  _______________________________________ " << endl;
	cout << " |            Поиск отделов              |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 1.Поиск по ID                         |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 2.Поиск по должности                  |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 3.Поиск по имени                      |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 4.Поиск по фамилии                    |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 5.Поиск по возрасту                   |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 6.Поиск по стажу                      |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 0.Выход                               |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << endl;
	cout << " Ваш выбор: ";

}

void employeesSortMenu() {

	system("cls");
	cout << "  _______________________________________ " << endl;
	cout << " |        Сортировка сотрудников         |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 1.Сортировать по ID                   |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 2.Сортировать по имени                |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 3.Сортировать по фамилии              |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 4.Сортировать по возрасту             |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 5.Сортировать по стажу                |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 0.Выход                               |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << endl;
	cout << " Ваш выбор: ";

}

void employeesFiltrMenu() {

	system("cls");
	cout << "  _______________________________________ " << endl;
	cout << " |        Фильтрация сотрудников         |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 1.Фильтовать по ID                    |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 2.Фильтовать по возрасту              |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 3.Фильтовать по стажу                 |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 0.Выход                               |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << endl;
	cout << " Ваш выбор: ";

}

void solveProblemMenu() {

	system("cls");
	cout << "  _______________________________________ " << endl;
	cout << " |        Меню принятия решения          |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 1.Добавить алтернативы                |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 2.Просмотреть альтернативы            |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 0.Выход                               |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << endl;
	cout << " Ваш выбор: ";
}

void whatElse() {
	system("cls");
	cout << "  _______________________________________ " << endl;
	cout << " |         Хотите ввести ещё?            |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 1.Да                                  |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 0.Нет                                 |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << endl;
	cout << " Ваш выбор: ";
}


void yesOrNo() {
	
	cout << "  _______________________________________ " << endl;
	cout << " | 1.Да                                  |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << " | 0.Нет                                 |" << endl;
	cout << " |_______________________________________|" << endl;
	cout << endl;
	cout << " Ваш выбор: ";
}